### Import the required Packages

In [3]:
import pandas as pd
import psycopg2
import warnings
warnings.filterwarnings("ignore")

### Declare the Variables

In [1]:
v_path = r"C:\Users\zope1\OneDrive\Desktop\Study\DataFolder\submission.csv"

In [4]:
df = pd.read_csv(v_path)

### Import the Data (From CSV)

In [5]:
df = pd.read_csv(v_path)

### Database Connectivity

In [6]:
conn = psycopg2.connect(
    dbname="enggcrm",
    user="postgres",
    password="Ashish@1996",
    host="localhost",
    port="5432"
)

In [7]:
df = pd.read_sql('SELECT * FROM master.employee', conn)

In [8]:
display(df)

,employeeid,empname,dob,createddate,createdby
0,1,Ashish Sunil Zope,1996-12-17,2025-05-18 00:14:10.824048,postgres
1,2,Vandana Sunil Zope,1976-04-28,2025-05-18 00:23:23.409831,postgres
2,3,Vandana Sunil Zope,1976-04-28,2025-05-18 00:40:07.928006,postgres
3,4,Vandana Sunil Z,1976-04-28,2025-05-18 00:42:26.022979,postgres

In [9]:
query = "SELECT  FROM master.employee"
df = pd.read_sql(query, conn)

In [10]:
from sqlalchemy import create_engine
from urllib.parse import quote_plus
password = quote_plus("Ashish@1996")
engine = create_engine(f'postgresql+psycopg2://postgres:{password}@localhost:5432/enggcrm')

In [11]:
import pandas as pd

df = pd.read_sql("SELECT * FROM master.employee", engine)
# df.to_sql("employee_01", engine, if_exists="replace", index=False)
df.to_sql('employee_01', engine, if_exists='replace', index=False, schema='master')

4

In [14]:
df3 = pd.read_sql('SELECT * FROM master.employee_01', conn)

In [15]:
df3

,employeeid,empname,dob,createddate,createdby
0,1,Ashish Sunil Zope,1996-12-17,2025-05-18 00:14:10.824048,postgres
1,2,Vandana Sunil Zope,1976-04-28,2025-05-18 00:23:23.409831,postgres
2,3,Vandana Sunil Zope,1976-04-28,2025-05-18 00:40:07.928006,postgres
3,4,Vandana Sunil Z,1976-04-28,2025-05-18 00:42:26.022979,postgres

In [16]:
# conn.close()